Converting from single to multi-tenant system
